INSERT INTO Artist 
	(Artist_name)
VALUES 
	('Noize_mc'),
	('Miyagi'),
	('The Prodigy'),
	('МакSим'),
	('Руки Вверх!'),
	('System of A Down'),
	('Linkin Park'),
	('Нейромонах Феофан'),
	('Queen'),
	('Кино'),
	('Kiss'),
	('Black Sabbath')
;

INSERT INTO Genre 
	(Genre_name)
VALUES
	('Rap'),
	('Electonics'),
	('Pop'),
	('Progressive metal'),
	('Drum and bass'),
	('Rock')
;

INSERT INTO Genre_Artist 
	(GenreID, ArtistID)
VALUES 
	(1, 1),
	(1, 2),
	(2, 3),
	(3, 4),
	(3, 5),
	(4, 6),
	(6, 7),
	(5, 8),
	(6, 9),
	(6, 10),
	(6, 11),
	(6, 12),
	(1, 6),
	(1, 7)
;

INSERT INTO Album 
	(Album_name, Album_year)
VALUES
	('Выход в город', '2021-11-18'),
	('Новый альбом', '2012-03-30'),
	('Buster Keaton', '2019-06-21'),
	('King Kong', '2019-11-14'),
	('Experience', '1992-09-01'),
	('Music for the Jilted Generation', '1994-07-04'),
	('The Day Is My Enemy', '2015-03-30'),
	('Трудный возраст', '2006-03-28'),
	('Мой рай', '2007-11-15'),
	('Открой мне дверь!', '2012-01-01'),
	('Когда мы были молодыми', '2020-01-01'),
	('Toxicity', '1999-05-06'),
	('Hypnotize', '2005-10-31'),
	('Steal This Album!', '2002-10-26'),
	('В душе драм, в сердце светлая Русь', '2015-02-03'),
	('Made in Heaven', '1995-06-05'),
	('A Kind of Magic', '1989-08-09'),
	('Innuendo', '1991-04-07'),
	('Группа крови', '1988-01-01'),
	('Чёрный альбом', '1991-02-03'),
	('Monster', '2012-10-15'),
	('Kiss', '1974-02-18'),
	('13', '2013-01-01'),
	('Past Lives', '2002-01-02'),
	('Sabotage', '1975-01-01')
;

INSERT INTO Artist_Album 
	(Album_ID, Artist_ID)
VALUES
	(1, 1),
	(2, 1),
	(3, 2),
	(4, 2),
	(5, 3),
	(6, 3),
	(7, 3),
	(8, 4),
	(9, 4),
	(10, 5),
	(11, 5),
	(12, 6),
	(13, 6),
	(14, 7),
	(15, 8),
	(16, 9),
	(17, 9),
	(18, 9),
	(19, 10),
	(20, 10),
	(21, 11),
	(22, 11),
	(23, 11),
	(24, 12),
	(25, 12)
;

INSERT INTO Collection 
	(Collection_name, Collection_year)
VALUES 
	('Mp-3 Collection', '2006-01-01'),
	('Unreleased', '2011-01-01'),
	('Their Law: The Singles', '2005-02-04'),
	('Медляки', '2013-02-05'),
	('Studio Collection', '2019-05-06'),
	('Greatest Hits', '1991-02-05'),
	('Неизвестные песни', '1989-12-22'),
	('100,000 Years', '2012-08-09'),
	('New_rap', '2022-01-02')
;
	

INSERT INTO Track 
	(Track_name, Duration, AlbumID)
VALUES
	('Вояджер-1', '00:03:39', 1),
	('Миокард', '00:03:02', 1),
	('Вьетнам', '00:04:02', 2),
	('Я глуп', '00:03:50', 2),
	('Captain', '00:03:34', 3),
	('Angel', '00:03:35', 3),
	('Jumanji', '00:03:36', 4),
	('Wind it UP', '00:04:33', 5),
	('Your Love', '00:05:31', 5),
	('Breathe', '00:05:34', 6),
	('Omen', '00:03:36', 6),
	('Invisible Sun', '00:04:16', 7),
	('The Day Is My Enemy', '00:04:24', 7),
	('Знаешь ли ты', '00:04:02', 8),
	('Ветром стать', '00:03:12', 8),
	('Научусь летать', '00:03:51', 9),
	('Не отдам', '00:03:37', 9),
	('Крошка моя', '00:04:10', 10),
	('18 мне уже', '00:04:07', 10),
	('Мой Алёшка', '00:03:25', 11),
	('Студент', '00:03:51', 11),
	('Chop Suey!', '00:03:30', 12),
	('Lonely Day', '00:02:47', 12),
	('ATWA', '00:02:56', 13),
	('B.Y.O.B', '00:04:15', 13),
	('Numb', '00:03:07', 14),
	('Faint', '00:02:44', 14),
	('In the End', '00:03:36', 14),
	('Притоптать', '00:02:55', 15),
	('Под драм легко', '00:02:44', 15),
	('Its A Beautiful Day', '00:02:34', 16),
	('Made in Heaven', '00:05:25', 16),
	('One Vision', '00:05:11', 17),
	('One Year of love', '00:04:27', 17),
	('Innuendo', '00:06:33', 18),
	('The show must go on', '00:04:31', 18),
	('Война', '00:04:04', 19),
	('В наших глазах', '00:03:34', 19),
	('Кончится лето', '00:05:56', 20),
	('Звезда', '00:04:30', 20),
	('Wall of sound', '00:02:55', 21),
	('Feak', '00:03:35', 21),
	('I was made for loving you', '00:04:28', 22),
	('Heavens on fire', '00:03:20', 22),
	('Detroit Rock City', '00:03:55', 23),
	('Love Gun', '00:03:15', 23),
	('Strangers Again', '00:03:42', 24),
	('The Fuss', '00:02:50', 24),
	('Iron Man', '00:00:18', 25),
	('War pigs', '00:07:54', 25)
;

INSERT INTO Collection_Track 
   (Collection_ID, Track_ID)
VALUES 
    (9, 1),
    (9, 2),
    (8, 3),
    (8, 4),
    (9, 5),
    (9, 6),
    (9, 7),
    (3, 8),
    (3, 9),
    (3, 10),
    (3, 11),
    (8, 12),
    (8, 13),
    (4, 14),
    (4, 15),
    (4, 16),
    (4, 17),
    (2, 18),
    (8, 19),
    (4, 20),
    (5, 21),
    (5, 22),
    (8, 23),
    (3, 24),
    (3, 25),
    (2, 26),
    (2, 27),
    (2, 28),
    (9, 29),
    (6, 31),
    (1, 32),
    (7, 33),
    (7, 34),
    (1, 35),
    (2, 36),
    (6, 37),
    (7, 38),
    (1, 39),
    (8, 40),
    (1, 41),
    (8, 42),
    (2, 43),
    (2, 44),
    (3, 45),
    (3, 46),
    (1, 47),
    (2, 48),
    (7, 49),
    (6, 50)
;